# Tutorial Data Preprocessing

## Tao đặc trưng mới - Feature extraction - (Feature extration 1 phần của Feature engineering)

- Dựa trên 1 số kinh nghiệm trên lĩnh vực của miền dữ liệu đang làm --> đặc trưng mới --> dự đoán giá trị ouput tốt hơn
- Dữ liệu dạng bảng --> bước quan trọng --> mô hình tăng độ accuracy lên (đây là sự khác biệt)

- ***Feature engineering***: bao gồm feature extraction, feature transformation, feature selection

## 1. Biến đổi toán học

In [6]:
import pandas as pd

df = pd.DataFrame({
    'velocity' : [7, 9, 11, 20, 10, 15],
    'time' : [8, 10, 6, 4, 3, 9]
})
df

   velocity  time
0         7     8
1         9    10
2        11     6
3        20     4
4        10     3
5        15     9

In [9]:
# Tạo thêm 1 đặc trưng bằng công thức toán học: v = s * t  | ở đây là phép nhân từng phần tử
df['distance'] = df['velocity'] * df['time']
df

   velocity  time  distance
0         7     8        56
1         9    10        90
2        11     6        66
3        20     4        80
4        10     3        30
5        15     9       135

## 2. Đếm số lần, tần số xuất hiện

In [11]:
# Đếm tần số xuất hiện
import pandas as pd

df = pd.DataFrame({
    'value' : [100, 150, 50, 200, 100, 100],
    'Color' : 'Red Red Blue Red Green Blue'.split()
    })
df

   value  Color
0    100    Red
1    150    Red
2     50   Blue
3    200    Red
4    100  Green
5    100   Blue

In [12]:
# đếm tần sốt xuất hiện --> tạo ra thêm 1 cột color_count --> đếm cột val trong dict
vc = df['Color'].value_counts().to_dict()
vc

{'Red': 3, 'Blue': 2, 'Green': 1}

In [14]:
# Thêm cột mới tần số color_count 
df['Colo_count'] = df['Color'].map(vc) # map dùng để color count tra trong bảng tương ứng là bao nhiêu --> điềm cho Color_count
df

   value  Color  Colo_count
0    100    Red           3
1    150    Red           3
2     50   Blue           2
3    200    Red           3
4    100  Green           1
5    100   Blue           2

## 3. Đếm số lương theo nhiều côt

In [15]:
df = pd.DataFrame({
    'Bus' : [0, 0, 0, 1, 0],
    'Car' : [0, 0, 0, 0, 1],
    'Motobike' : [0, 1, 0, 0, 1]
    })
df

   Bus  Car  Motobike
0    0    0         0
1    0    0         1
2    0    0         0
3    1    0         0
4    0    1         1

In [ ]:
# Kiểm tra có dùng vehicle ko
vehicles = ['Car', 'Motobike', 'Bus']
df['use_vehicle'] = df[vehicles].max(axis=1)
df

   Bus  Car  Motobike  use_vehicle
0    0    0         0            0
1    0    0         1            1
2    0    0         0            0
3    1    0         0            1
4    0    1         1            1

## 4. Phân rã đặc trưng từ chuỗi có cấu trúc

- Dữ liệu dataframe đuượ format theo dạng nhất dạng

In [20]:
df = pd.DataFrame({
    'OSInfo' : [
            'Apple MacOS X 10.0', 'Microsoft Windows 11', 
            'Microsoft Window XP', 'Apple MacOS X 10.5', 
            'Apple iOS 11.5', 'Microsoft Windows Vista'
        ]
})
df

                    OSInfo
0       Apple MacOS X 10.0
1     Microsoft Windows 11
2      Microsoft Window XP
3       Apple MacOS X 10.5
4           Apple iOS 11.5
5  Microsoft Windows Vista

In [ ]:
# tách theo hãng hẹ điều hành - phiên bản
df['OSInfo'].str.split(' ', n=1, expand=True) # n: số cột tách thêm theo từ

           0              1
0      Apple   MacOS X 10.0
1  Microsoft     Windows 11
2  Microsoft      Window XP
3      Apple   MacOS X 10.5
4      Apple       iOS 11.5
5  Microsoft  Windows Vista

In [26]:
# Sao khi tách dữ liệu --> thay đổi tên bảng
df['OSInfo'].str.split(' ', n=1, expand=True).rename(columns={0:'company', 1:'OS'})

     company             OS
0      Apple   MacOS X 10.0
1  Microsoft     Windows 11
2  Microsoft      Window XP
3      Apple   MacOS X 10.5
4      Apple       iOS 11.5
5  Microsoft  Windows Vista

In [ ]:
# Sao đó merge lại dataFrame cũ và DataFrame mới các cột mới tách ra theo các đặc trưng mới = 'join'
df.join(df['OSInfo'].str.split(' ', n=1, expand=True).rename(columns={0:'Company', 1:'OS'}))

                    OSInfo    Company             OS
0       Apple MacOS X 10.0      Apple   MacOS X 10.0
1     Microsoft Windows 11  Microsoft     Windows 11
2      Microsoft Window XP  Microsoft      Window XP
3       Apple MacOS X 10.5      Apple   MacOS X 10.5
4           Apple iOS 11.5      Apple       iOS 11.5
5  Microsoft Windows Vista  Microsoft  Windows Vista

## 5. Tổng hợp đặc trưng

- Phần nguợc lại của phân rã đặc trưng ==> tư 2 chuỗi trộn lại thành 2 đặc trưng

In [ ]:
df = pd.DataFrame({
    'Make' : ['Toyota', 'Audi', 'Honda', 'Honda', 'Toyota', 'Mercesdes'],
    'Type' : ['Sedan', 'Sedan', 'Crossover', 'Hatchback', 'SUV', 'Sedan']
})
df

        Make       Type
0     Toyota      Sedan
1       Audi      Sedan
2      Honda  Crossover
3      Honda  Hatchback
4     Toyota        SUV
5  Mercesdes      Sedan

In [32]:
df['Make_type'] = df['Make'] + "_" + df['Type']
df

        Make       Type        Make_type
0     Toyota      Sedan     Toyota_Sedan
1       Audi      Sedan       Audi_Sedan
2      Honda  Crossover  Honda_Crossover
3      Honda  Hatchback  Honda_Hatchback
4     Toyota        SUV       Toyota_SUV
5  Mercesdes      Sedan  Mercesdes_Sedan

## 6. Tổng hợp đặc trưng theo nhóm

- thưc hiện trên 1 đặc trưng của dữ liệu

In [34]:
df = pd.DataFrame({
    'City' : ['Danang', 'HCM', 'Hanoi', 'HCM', 'HCM', 'Hanoi', 'Danang'],
    'Salary' : [10, 20, 15, 8, 12, 15, 14]
})

df

     City  Salary
0  Danang      10
1     HCM      20
2   Hanoi      15
3     HCM       8
4     HCM      12
5   Hanoi      15
6  Danang      14

- Gôm nhóm theo tưng giá trị, sau đó thực hiện thao tác thống kê

In [ ]:
# Gôm nhóm thành mức lương trung bình: ví dụ DN có cột lương và muốn tạo thêm 1 cột lương trung bình ==> dùng lệnh '.agg'
# b1: phải groupby cột key ==> lấy ra val xong dùng phương thức agg
# Cách 1
df.groupby('City')['Salary'].agg('mean')

City
Danang    12.000000
HCM       13.333333
Hanoi     15.000000
Name: Salary, dtype: float64

In [38]:
# Cách 2: dùng lệnh transform
df.groupby('City')['Salary'].transform('mean')

0    12.000000
1    13.333333
2    15.000000
3    13.333333
4    13.333333
5    15.000000
6    12.000000
Name: Salary, dtype: float64

- lệnh transform này sao khi tính trung bình và sẽ gán lương trung bình lại tương ứng từng tp, còn agg thì thể hiện các tp ko trùng + lương trung bình
- Lệnh agg thì ko thể nối vào bảng DataFrame cũ đuợc vì chênh lệch số lượng

In [ ]:
# Tạo thêm 1 cột mới tính lương trung bình
df['AvgSalary'] = df.groupby('City')['Salary'].transform('mean')
df

     City  Salary  AvgSalary
0  Danang      10  12.000000
1     HCM      20  13.333333
2   Hanoi      15  15.000000
3     HCM       8  13.333333
4     HCM      12  13.333333
5   Hanoi      15  15.000000
6  Danang      14  12.000000

## 7. Đặc trưng cụm (***Phân khúc***)

In [43]:
df = pd.DataFrame({
    'City' : ['Danang', 'HCM', 'Hanoi', 'HCM', 'HCM', 'Hanoi', 'Danang', 'Danang', 'Hanoi', 'HCM'],
    'Salary' : [10, 20, 15, 8, 12, 15, 14, 35, 30, 5]
})

df

     City  Salary
0  Danang      10
1     HCM      20
2   Hanoi      15
3     HCM       8
4     HCM      12
5   Hanoi      15
6  Danang      14
7  Danang      35
8   Hanoi      30
9     HCM       5

- Gôm nhóm dựa trên chính giá trị để phân thành các phân khúc khác nhau ==> xem trưc tiếp tren giá trị 
- Xét 10 vói các dữ liệu lương bằng kỹ thuật gôm nhóm bằng kỹ thuật **unsupervised learning** - `K Means`

In [48]:
from sklearn.cluster import KMeans
import numpy as np

kmeans = KMeans(n_clusters=3, n_init='auto')
df['SalCluster'] = kmeans.fit_predict(np.array(df['Salary']).reshape(-1, 1))
df['SalCluster'] = df['SalCluster'].astype('category')
df

# Các giá trị cluster ở đây không mang giá trị so sánh --> chi mang tính chất đại diện

     City  Salary SalCluster
0  Danang      10          2
1     HCM      20          1
2   Hanoi      15          1
3     HCM       8          2
4     HCM      12          1
5   Hanoi      15          1
6  Danang      14          1
7  Danang      35          0
8   Hanoi      30          0
9     HCM       5          2

## 8. Sự dụng đặc trung giảm chiều (PCA - **Unsupervised learning**)

In [49]:
import numpy as np
import matplotlib.pyplot as plt 
from sklearn import datasets
from sklearn.decomposition import PCA 
import pandas as pd 
from sklearn.preprocessing import StandardScaler

In [56]:
iris = datasets.load_iris()
X = iris.data
X = pd.DataFrame(data=X, columns=iris['feature_names'])
X

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [57]:
# scale dữ liệu để PCA học tốt hơn --> phân phối chuẩn
scaler = StandardScaler()
X = scaler.fit_transform(X)
X = pd.DataFrame(data=X,  columns=iris['feature_names'])
pca = PCA(n_components=2) # số lượng đặc trưng muốn giảm xuống
x_new = pca.fit_transform(X)

X.join(pd.DataFrame(data=x_new, columns=['pca_1', 'pca_2']))

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),pca_1,pca_2
0,-0.900681,1.019004,-1.340227,-1.315444,-2.264703,0.480027
1,-1.143017,-0.131979,-1.340227,-1.315444,-2.080961,-0.674134
2,-1.385353,0.328414,-1.397064,-1.315444,-2.364229,-0.341908
3,-1.506521,0.098217,-1.283389,-1.315444,-2.299384,-0.597395
4,-1.021849,1.249201,-1.340227,-1.315444,-2.389842,0.646835
...,...,...,...,...,...,...
145,1.038005,-0.131979,0.819596,1.448832,1.870503,0.386966
146,0.553333,-1.282963,0.705921,0.922303,1.564580,-0.896687
147,0.795669,-0.131979,0.819596,1.053935,1.521170,0.269069
148,0.432165,0.788808,0.933271,1.448832,1.372788,1.011254
149,0.068662,-0.131979,0.762758,0.790671,0.960656,-0.024332